PhoneList = [
    ['','手机号错误'],
    ['21366666666','手机号错误'],
    ['1323333333','手机号错误'],
    ['15500000000','该学生不在这所学校'],
    ['17666666666']
]

pwd_list = [
    ['',''],
    ['12','密码长度应不小于6位'],
    ['sagadgrha','手机号或密码错误'],
    ['123321']
]

amount_phone_error = [
    '17666666666\n',
    '13222222222\n',
    '21333333333'
]

amount_phone_right = [
    '19999999999\n',
    '13232232323'
]

student_number = [
    ['','请输入学生手机号或昵称'],
    ['   ','本校无此学生'],
    ['0', '本校无此学生'],
    ['我', '本校无此学生'],
    ['，《：「」', '本校无此学生'],
    ['abc', '本校无此学生'],
    ['137123456789','本校无此学生'],
    ['13712345678', '本校无此学生'],
    ['19999999999']
]

student_buy_data = [
    ['19999999999', '','请输入正确密码'],
    ['', '123321', '请输入正确的手机号'],
    ['19999999999', '123322','手机号或密码错误'],
    ['15000020003', '123456','本优惠为5.21学员专享，请联系学校老师获取优惠'],
    ['13298765432', '123321', '该学生账号不存在'],
    ['15222380003', '123123', '该学生账号不存在'],
    ['19999999999', '123321']
]

pwd_retreat = [
    ['','请输入密码'],
    ['123', '密码长度应不小于6位'],
    ['1233333', '手机号或密码错误'],
    ['123321']
]