schoolName = [
    ['天津市东丽区东丽开发区西三道158号金融中心5号楼7门1108','学校名称由1-30个中文、数字、英文组成'], # 不可以
    ['      ','学校名称由1-30个中文、数字、英文组成'] # 不可以
]

schoolNickname = [
    ['我就想输入这么多了','简称不超过8个中文或20个字母'], # 9个汉字 不可以
    ['abcdefghijklmnopqrstu','简称不超过8个中文或20个字母'], # 21个字母 不可以
    ['123456789'], # 9个数字 可以
    ['abcdefghi'], # 9个字母 可以
    ['1我就是我不一样的我'] # 1个数字9个中文 可以
]

schoolManagerInfoError = [
    ['','13233333333','姓名由2-20位中文、数字、英文组成'],
    ['凌凌七','13233333332','已是他校校管'],
    ['小板凳','11111111111','手机号格式不正确']
]

schoolManagerInfoMany = [
    ['Uranus','18909876543'],
    ['凌凌七','13112345678'],
    ['小板凳','15312345678'],
    ['Hecate','13409876543'],
    ['hades','13512345678'],
    ['哈迪斯','13612345678'],
    ['丘比特','13709876543'],
    ['宙斯','13812345678'],
    ['赫拉','13909876543'],
    ['波塞冬','15109876543'],
    ['阿波罗','15209876543']
]

schoolInfo = {
    'schoolName': 'xxh高级中学',
    'schoolNickname': 'xxh',
    'principalName': 'xxh校长',
    'wechat': 'xxh1234567',
    'principalPhone': '13412345678',
}